from llama_cpp import Llama

# Предварительно скачай сам файл .gguf на диск
llm = Llama(
    model_path="tweety-7b-tatar-v24a.Q3_K_M.gguf",
    n_gpu_layers=-1, # -1 сгрузит все слои на видеокарту
    n_ctx=2048       # Окно контекста
)

text = "Мин бәйрәм көн һәм тыныч Ауропа тормыш чит, һәм, әлбәттә, миңа үзенең барысы да белә торган, халык бик яхшы эсседа булган тыгыз Җылы Голландия краенда булырга бик күңелле."

output = llm(
    "Киләсе текстта бары тик грамматик хаталарны һәм дөрес тәмамланмаганны гына төзәт. Текстның һәм сүзнең мәгънәсен үзгәртмә. Бернинди аңлатмаларсыз, төзәтелгән текст кына яз:" + text, 
    max_tokens=512, 
    echo=True, 
    stop=["</s>"],
    temperature=0.7,         # Чуть больше случайности (от 0.0 до 1.0)
    repeat_penalty=1.1       # Штраф за повторение слов (обычно 1.1 - 1.2)
)
print(output['choices'][0]['text'])